aktiv_txt: dict[str, str] = {
'opis': (
    'В этом разделе можно узнать о том, какие студенческие объединения и организации существуют в Университете:'
),
'bss': (
    '<a href="https://vk.com/ssspbu">Студенческий совет СПбГУ</a> — это представительный орган, в который входят председатели студенческих советов всех факультетов и институтов Университета, а также председатели комитетов Cтуденческого совета СПбГУ.\n\n'
    'Основная задача студенческого совета — представлять интересы студентов на высшем административном уровне Университета.\n\n'
    'Непосредственно работа Студсовета осуществляется комитетами, входящими в его состав:\n\n'
    '1. <a href="https://vk.com/obshchagi_spbu">Комитет по работе с общежитиями</a> — занимается вопросами проживания в общежитиях СПбГУ;\n\n'
    '2. <a href="https://vk.com/umk_bss">Учебно-методический комитет</a> — занимается обеспечением качественной работы Студенческого совета СПбГУ по вопросам организации учебных занятий;\n\n'
    '3. <a href="https://vk.com/public184298031">Правовой комитет</a> – занимается работой с локальными НПА и консултацией студентов по вопросам их прав;\n\n'
    '4. <a href="https://vk.com/diskom_spbu">Дисциплинарный комитет</a> — содействуюет защите прав студентов при рассмотрении дел о дисциплинарных нарушениях;\n\n'
    '5. <a href="https://vk.com/eco_spbu">Экологический комитет</a> — занимается экологическим просвещением универсантов СПбГУ; реализацией и управлением экологическими проектами;\n\n'
    '6. <a href="https://vk.com/sockomitet">Социальный комитет</a> – работает по вопросам социальных проблеи;\n\n'
    '7. <a href="https://vk.com/spbuevent">Культурно-массовый комитет</a> – организует всевозможные мероприятия на уровне Университета;\n\n'
    '8. <a href="https://vk.com/kompit_spbu">Комитет по питанию</a> — занимается контролем организации питания на территории Университета.\n\n'
),
'sport': (
    '!SOS!'
),
'otrads': (
    '<b>Студенческий отряд</b> - это дружный коллектив студентов, объединенных общими интересами.\n\n'
    'Также отряды дают возможность освоить дополнительную профессию.\n\n'
    'Отряды работают по различным направлениям летом, а также в течение года при желании и возможности участников. \n\nВ СПбГУ представлено 6 направлений:\n\n'
    '1. <b>Педагогические отряды</b>: <a href="https://vk.com/skazkaspo">«Сказка»</a>, <a href="https://vk.com/welcome_unison">«Унисон»</a>, <a href="https://vk.com/sporos">"РОС"</a>, <a href="https://vk.com/spo_granat">"Гранат"</a> и <a href="https://vk.com/shvm_perspective">"Перспектива"</a> работают вожатыми в детских лагерях;\n\n'
    '2. <b>Археологический отряд</b> <a href="https://vk.com/sao_tor">«Тор»</a> участвует в археологических экспедициях;\n\n'
    '3. <b>Сельскохозяйственный отряд</b> <a href="https://vk.com/ssho_povidlo">"Повидло"</a> работает на сборе урожая на юге России;\n\n'
    '4. <b>Медицинский отряд</b> <a href="https://vk.com/smo_neuron">"Нейрон"</a> работает в мед. учреждениях России;\n\n'
    '5. <b>Экологический отряд</b> <a href="https://vk.com/seo_juniper">«Можжевельник»</a> работает в заповедниках и других ООПТ;\n\n'
    '6. <b>Отряд проводников</b> <a href="https://vk.com/sopmercury">"Меркурий"</a> работает на железной дороге проводниками.\n\n'
    'Два из десяти отрядов базируются в ПУНКе, это «Сказка» и «Унисон», оба педагогические. \nВ течение года они проводят много открытых мероприятий для всех желающих.\n\n'
    '❗В отряде открывается много возможностей для развития коммуникативных, организаторских, управленческих навыков!'
),
'clubs': (
    'Помимо учебной и научной деятельности университет богат традициями художественного творчества, есть множество творческих коллективов, занятия которых в ДКиН "Шайба":\n\n'
    '💃 <a href="https://vk.com/klub_ovatsija">Клуб спортивного бального танца "Овация"</a>\n'
    '👩‍💼 Руководитель — Татьяна Николаевна Сергеева (+7(921)949-78-62)\n\n'
    '🎨 Студия изобразительного творчества\n'
    '👩‍💼 Руководитель — Валентина Анатольевна Кохистане (+7(951)655-42-56)\n\n'
    '🀄️ <a href="https://vk.com/nigiri">Го Клуб СПбГУ "Нигири"</a>\n'
    '🧑‍💼 Руководитель – Семён Вячеславович Юрченко (+7(981)857-92-43)\n\n'
    '🕺 <a href="https://vk.com/ansorcoir">Студия кельтских танцев «An Sorcoir»</a>\n'
    '👩‍💼 Руководитель – Марина Олеговна Лысюк (+7(969)711-14-70)\n\n'
    '🎥 Клуб обсуждения кино «Aperture»\n'
    '🧑‍💼 Руководитель – Алексей Дмитриевич Любомиров (+7(981)834-43-07)\n\n'
    '♟ Клуб настольных игр\n'
    '🧑‍💼 Руководитель – Дмитрий Николаевич Ткаченко (+7(961)239-86-69)\n\n'
    'Более подробно о времени и месте занятий можно узнать у Романа Николаевича Пирко (+7(900)625-40-83) или на <a href="https://students.spbu.ru/mmen-meroprijatija/tvorcheskie-kollektivy/2201-tvorcheskie-kollektivy-raspolagayushchiesya-v-dkin-spbgu.html">сайте</a>.\n\n'
    'Также существует множество коллективов, посвященных танцам, вокалу, театральному искусству и фотографии, занятия которых проходят на Васильевском остров, подробнее о них можно узнать <a href="https://students.spbu.ru/mmen-meroprijatija/tvorcheskie-kollektivy.html">здесь</a>.'
)

}