aktiv_txt: dict[str, str] = {
'opis': (
    'В этом разделе можно узнать о том, какие студенческие объединения и организации существуют в Университете:'
),
'bss': (
    '<a href="https://vk.com/ssspbu">Студенческий совет СПбГУ</a> — выборный орган студенческого самоуправления, основной задачей которого является представление и отстаивание интересов студентов Университета на высшем уровне, например, на встречах с ректором.\n'
    'Также часто Студенческий совет дает оценку изменениям, ожидающим Университет.\n\n'
    'В данный момент вCтуденческом совете функционируют 6 комитетов:\n\n'
    '1. <a href="https://vk.com/obshchagi_spbu">Комитет по работе с общежитиями</a> — занимается вопросами проживания в общежитиях СПбГУ;\n\n'
    #'2. <a href="https://vk.com/umk_bss">Учебно-методический комитет</a> — занимается обеспечением качественной работы Студенческого совета СПбГУ по вопросам организации учебных занятий;\n\n'
    '2. <a href="https://vk.com/public184298031">Правовой комитет</a> — занимается работой с локальными НПА и консултацией студентов по вопросам их прав;\n\n'
    '3. <a href="https://vk.com/diskom_spbu">Дисциплинарный комитет</a> — содействуюет защите прав студентов при рассмотрении дел о дисциплинарных нарушениях;\n\n'
    '4. <a href="https://vk.com/eco_spbu">Экологический комитет</a> — занимается экологическим просвещением универсантов СПбГУ; реализацией и управлением экологическими проектами;\n\n'
    '5. <a href="https://vk.com/sockomitet">Социальный комитет</a> — работает по вопросам социальных проблем;\n\n'
    '6. <a href="https://vk.com/spbuevent">Культурно-массовый комитет</a> — организует всевозможные мероприятия на уровне Университета;\n\n'
    #'8. <a href="https://vk.com/kompit_spbu">Комитет по питанию</a> — занимается контролем организации питания на территории Университета.\n\n'
),
'sport': (
    'Санкт-Петербургский университет предоставляет своим студентам широкие возможности для занятий спортом. Для этого работают многочисленные секции, где можно заниматься баскетболом, волейболом, боксом, футболом и другими видами спорта, а также посещать тренажёрные залы.\n'
    'На территории студгородка расположены открытые волейбольная и баскетбольная площадки, столы для настольного тенниса и бесплатный бильярдный клуб. Для посещения тренажёрного зала требуется справка о состоянии здоровья.\n\n'
    'Подробное расписание секций можно узнать на <a href="https://uosd.spbu.ru/UOSD_sport_for_all.php">сайте</a> или непосредственно по месту их проведения.\n\n'
    'Кроме любительского спорта, в Университете активно развиваются и спортивные соревнования. За их организацию отвечает <a href="https://uosd.spbu.ru/UOSDmain.php">Управление по организации спортивной деятельности</a> и, как его часть, <a href="https://vk.com/spbu.sport?from=search">Спортивный клуб СПбГУ</a>.\n'
    'В начале учебного года Спортивный клуб проводит отборы в сборные команды СПбГУ для участия в соревнованиях разного уровня.\n\n'
    'Ещё в Университете существует <a href="https://vk.com/sportclub_spbu?from=search">Спортивный клуб "Балтийские орланы"</a>.\n'
    'Он также занимается тренировкой спортсменов и в отстаивании чести Университета на межвузовских соревнованиях.\n'
    'Клуб, кроме прочего, является также главным организатором студенческого фестиваля <a href="https://vk.com/@sportclub_spbu-mnogofunkcionalnaya-platforma-dlya-aktivnoi-molodezhi-campus">Campus Fest”</a>, '
    'объединяющего на одной площадке различные направления внеучебной деятельности – от музыки и поэзии до спорта и волонтёрства.'
),
'otrads': (
    'В стенах Университета работают различные <b>студенческие отряды</b>, в которые входят студенты, объединенные общими интересами.\n'
    'В рамках отрядной деятельности студенты могут работать вожатыми в различных лагерях, помогать врачам в больницах и поликлиниках,  работать проводниками на железных дорогах и на многих других интересных специальностях. В рамках участия в студенческих отрядах можно получить дополнительную профессию, помимо получения высшего образования в Университете.\n\n'
    'В СПбГУ имеется 7 направлений студенческих отрядов:\n\n'
    '1. <b>Педагогические отряды</b>.\n'
    'Наиболее широко представленные в СПбГУ отряды, студенты из данных отрядов работают вожатыми в детских лагерях. В данный момент функционируют 5 педагогических отрядов:<a href="https://vk.com/skazkaspo">"Сказка"</a>, <a href="https://vk.com/welcome_unison">"Унисон"</a>, <a href="https://vk.com/sporos">"РОС"</a>, <a href="https://vk.com/spo_granat">"Гранат"</a> и <a href="https://vk.com/shvm_perspective">"Перспектива"</a>;\n\n'
    '2. <b>Археологический отряд</b> “Тор” выезжает в археологические экспедиции по всей территории России, в том числе на Тамань и республику Тыву;\n\n'
    '3. <b>Сельскохозяйственный отряд</b> “Повидло” летом выезжает на работу на юг России, где ухаживает за виноградниками, собирает урожай, а в свободное время купается в море и гуляет в горах;\n\n'
    '4. <b>Медицинский отряд</b> <a href="https://vk.com/smo_neuron">"Нейрон"</a> работает в больницах по всей России, занимается волонтерством;\n\n'
    '5. <b>Экологический отряд</b> <a href="https://vk.com/seo_juniper">"Можжевельник"</a> помогает питомникам и центрам помощи животным, работает в заповедниках и проводит экологические мастер-классы;\n\n'
    '6. <b>Отряд проводников</b> <a href="https://vk.com/sopmercury">"Меркурий"</a> работает проводниками на железнодорожных маршрутах дальнего следования;\n\n'
    '7. <b>Отряд молодежной патриотической акции “Невский десант”</b> <a href="https://vk.com/ond_spbu">“Медный всадник”</a> занимается волонтерской деятельностью на территории России, проводит уроки и мастер-классы.\n\n'
    'Студенческие отряды “Сказка” и “Унисон” базируются в ПУНКе, так что желающие попробовать себя в качестве вожатого в детском лагере приглашаются в данные студенческие отряды, это отличный способ завести новые знакомства, а также научиться коммуницировать с людьми самых разных возрастов!'
),
'clubs': (
    'Помимо учебной и научной деятельности университет богат традициями художественного творчества, есть множество творческих коллективов, занятия которых проходят в ДКиН "Шайба":\n\n'
    '🎨 Студия изобразительного творчества\n'
    '👩‍💼 Руководитель — Валентина Анатольевна Кохистане (+7(951)655-42-56)\n\n'
    '🀄️ <a href="https://vk.com/nigiri">Го Клуб СПбГУ "Нигири"</a>\n'
    '🧑‍💼 Руководитель – Семён Вячеславович Юрченко (+7(981)857-92-43)\n\n'
    '🕺 <a href="https://vk.com/ansorcoir">Студия кельтских танцев "An Sorcoir"</a>\n'
    '👩‍💼 Руководитель – Марина Олеговна Лысюк (+7(969)711-14-70)\n\n'
    '🎥 Клуб обсуждения кино "Aperture"\n'
    '🧑‍💼 Руководитель – Алексей Дмитриевич Любомиров (+7(981)834-43-07)\n\n'
    '♟ Клуб настольных игр\n'
    '🧑‍💼 Руководитель – Данил Андреевич Осянин (+7(924)242-49-12)\n\n'
    '🎙️ Петергофский хор, аудитория № 105\n'
    '🧑‍💼 Руководитель – Артём Алексеевич Коромыслов (+7(920)011-22-48)\n\n'
    '🏋️ Основы Физической Подготовки, аудитория № 204\n'
    '🧑‍💼 Руководитель – Татьяна Николаевна Сергеева (+7(921)949-78-62)\n\n'
    '👘 Танцевальная студия “K-POP Cover Dance”, аудитория № 209\n'
    '🧑‍💼 Руководитель – Светлана Георгиевна Мадиева (+7(917)769-37-99)\n\n'
    'Более подробно о времени и месте занятий можно узнать у Романа Николаевича Пирко (+7(900)625-40-83) или на <a href="https://students.spbu.ru/mmen-meroprijatija/tvorcheskie-kollektivy/2201-tvorcheskie-kollektivy-raspolagayushchiesya-v-dkin-spbgu.html">сайте</a>.\n\n'
    'Также существует множество коллективов, посвящённых танцам, вокалу, театральному искусству и фотографии, занятия которых проходят на Васильевском остров, подробнее о них можно узнать <a href="https://students.spbu.ru/mmen-meroprijatija/tvorcheskie-kollektivy.html">здесь</a>.'
)

}