inst_txt: dict[str, str] = {
'institute': 'Здесь вы можете найти всю нужную информацию о нашем Институте:',
'sience': 'В Институте помимо учёбы вы также сможете присоединиться к одному из научных коллективов, где вас познакомят с проведением всевозможных экспериментов. \nТакой опыт очень полезен вне зависимости от того, где вы собираетесь работать по окончании Университета, будь то научная сфера или же производственное предприятие. \n\nО научной деятельности вы можете узнать либо на <a href="https://chem.spbu.ru/research/nauchnye-gruppy.html">сайте Института</a>, либо посетив соответствующие экскурсии по научным группам, о которых будет рассказано позже.\n\n'
#'Для удобства в этом разделе вы также можете ознакомиться с электронными анотациями, содержащими актуальную информацию о научных группах.',
,
'olymps_cocn':(
    'Жизнь в Институте не ограничивается одной лишь учёбой и культурно-массовыми мероприятиями. Для всех студентов ежегодно проводятся также многочисленные научные конкурсы и олимпиады. Отдельно стоит отметить и конференцию, организуемую администрацией Института химии — “Менделеев”.\n\n'
    'Участие во всевозможных состязаниях позволит вам приобрести новые знания, завести новые знакомства, получить бесценный опыт и, конечно же, претендовать на призы и именные стипендии.\n\n'
    'Подробнее о конкурсах и олимпиадах вы можете узнать ниже:'
),
'opisuch': (
    'Учёба — основное и главное занятие всех студентов. В этом разделе вы можете ознакомиться с её структурой и с некоторыми важными тонкостями:'
),
'brat': (
    'Перед началом учебного года следует закупиться всем необходимым, чтобы не тратить на это время в начале семестра:\n'
    '1. Лабораторный халат - пригодится вам для выполнения лабораторных работ. Найти его можно в любом магазине медицинской одежды, а также на Wildberries или Ozon;\n'
    '2. Тетради - советуем взять 4-5 больших тетрадей для лекций по основным предметам и столько же для семинарских занятий. Возможно, в последствии вам пригодится ещё тонкая тетрадь для индивидуальных домашних заданий по высшей математике;\n'
    '3. Ручки, карандаши и линейка - мастхев для ведения конспектов, ручек лучше взять побольше, ибо писать придется много;\n'
    '4. Калькулятор - пригодится на контрольных, где зачастую запрещают пользоваться калькулятором на телефоне;\n'
    '5. Маркеры/цветные ручки/корректоры и любая другая подобная канцелярия - если вам хочется разнообразить свои конспекты).\n\n'
    'Помимо этого, рекомендуем взять с собой:\n'
    '1. Удобная закрытая обувь - на ногах придется проводить много времени, так что лучше позаботиться о себе заранее;\n'
    '2. Ноутбук/компьютер - многие задания удобнее выполнять в электронном формате, не забудьте взять из дома свой ноут);\n'
    '3. Можно взять какую нибудь бутылочку для воды, потому что до фонтанчика из некоторых частей факультета может быть идти далековато.'
),
'ucheba':(
    'Учебный год составляют 2 семестра:\n'
    '🍁 Осенний: 1 сентября - 30 января;\n'
    '🌱 Весенний: 11 февраля - 5 июля.\n\n'
    'Для отдыха предусмотрено 3 длительных каникулярных периода:\n'
'🎅 1 - 8 января (Новогодние каникулы);\n'
'❄️ 30 января - 10 февраля (Зимние каникулы);\n'
'☀️ 6 июля - 31 августа (Летние каникулы).\n\n'
'В течение семестра у студентов реализуется 4 вида занятий:\n'
'1. <b>Лекции</b> — на них читается базовый теоретический материал;\n'
'2. <b>Семинары</b> — на них студенты совместно с преподавателями закрепляют и прорабатывают материал, данный на лекциях, учатся решать задачи;\n'
'3. <b>Лабораторные работы</b>, в ходе которых студенты получают навыки “работы руками”;\n'
'4. <b>Практические занятия</b> — занятия, совмещающие в себе лекции и семинары (будут даваться как теория, так и практические задания).\n\n'

),
'control': (
   'Для оценки усвоения студентами учебной программы, существует несколько видов контроля знаний:\n\n'
   '1. <b>Коллоквиум</b> — своеобразная подготовка к экзамену; формат его определяется преподавателем, но как правило во время коллоквиума студенты отвечают по билетам, вопросы из которых могут быть выданы студентам за несколько дней до самого коллоквиума.\n\n'
   'Несмотря на то, что оценки за коллоквиум никуда не идут в дальнейшем, они важны для самопроверки.\n'
   '<i>Помимо прочего, успешная сдача коллоквиума по физике избавляет вас от одного вопроса на экзамене!</i>\n\n'
   '2. <b>Зачёт</b> — фактически является допуском к экзамену по дисциплинам, для которых предусмотрен экзамен. Для его получения необходимо своевременно и в полной мере выполнить все задания за семестр (ИДЗ, лабораторные работы, контрольные и т.п.).\n'
   'В большинстве случаев выполнение вышеупомянутых заданий позволяет получить зачёт автоматом, однако некоторые преподаватели могут провести дополнительные испытания непосредственно в день зачёта.\n\n'
   '3. <b>Экзамен</b> — финальное испытание за семестр. Традиционно на экзамене вы вытягиваете билет и готовитесь к ответу в течение 30-60 минут, расписывая ответы на вопросы. После этого вы устно отвечаете преподавателю на вопросы билета и дополнительные вопросы.\n\n'
   'Экзамены и зачёты оцениваются параллельно по двум системам: “традиционной” и буквенной (ECTS):\n'
   '😃 “A” — “Отлично” — 5;\n'
   '😀 “B” — “Хорошо” — 4,5;\n'
   '🙂 “C” — “Хорошо” — 4;\n'
   '😐 “D” — “Удовлетворительно” — 3,5;\n'
   '🙁 “E” — “Удовлетворительно” — 3;\n'
   '☹️ “F” — “Неудовлетворительно” — 0.\n\n'
   'При получении оценки “F” за зачёт или экзамен вы отправляетесь на пересдачу. Если на пересдаче вы так же получили оценку “F”, то вы отправляетесь на пересдачу с комиссией. Она отличается от предыдущей тем, что её принимает комиссия из трёх человек, оценка выносится коллегиально.'


),
'english':(
    'При поступлении студенты проходят тестирование по английскому языку в системе <a href="http://bb.spbu.ru/">Blackboard</a>, состоящее из тестовой части и аудирования. По результатам тестирования осуществляется распределение обучающихся по траекториям:\n'
    '1. A1-A2 — начальный уровень;\n'
    '2. А2-В1 — средний уровень;\n'
    '3. В1-В2 — высокий уровень;\n'
    '4. В2+ — продвинутый уровень.\n'
    'Студенты, определённые на первые три траектории посещают две пары английского языка в неделю, остальные — одну.\n\n'
    'В конце каждого семестра проводится зачёт, формат которого определяется преподавателем.\n\n'
    'В конце второго курса каждый студент СПбГУ <u>обязан</u> пройти квалификационные испытания на уровень В2.'
),
'fizra':(
    'Для физической культуры действует балльно-рейтинговая система. \nДля получения аттестации необходимо к концу второго курса набрать <b>400</b> баллов.\n\n'
    'Основным способом заработать баллы является посещение <a href="https://sport.spbu.ru/15-raspisanie.html">спортивных секций</a>, каждое занятие даёт 5 баллов.\n'
    'Выбор секции для занятий происходит в Blackboard, там же можно следить за количеством баллов.\n\n'
    'В начале года необходимо пройти <a href="https://edu.spbu.ru/405-grafik-meditsinskogo-osmotra-v-2024-godu.html">медосмотр</a>, по итогам которого определят вашу группу здоровья (это необходимо для допуска на занятия).\n\n'
    'Помимо занятий в спортзале баллы можно получить следующими способами:\n\n'
    '🏃 Прохождение мониторинга (20 баллов, 2 раза в год).\n'
    '<i>На почту будет выслано письмо с подробной информацией. В назначенное время вам нужно будет пройти небольшой медосмотр и анкетирование.</i>\n\n'
    '🧘‍♂️ Посещение занятий в фитнес-клубе.\n'
    '<i>При предъявлении копии договора на приобретение абонемента в фитнес-клуб вы получите 220 баллов за годовой и 110 баллов за полугодовой абонемент.</i>\n\n'
    '❓ Написание тестов в системе Blackboard, начиная со второго курса.\n\n'
    '🥇 Получение золотого или серебряного значка ГТО <u>соответствующей возрастной ступени</u> на 1-2 курсах дает 400 или 300 баллов, соответственно. А если вы состоите в спортивной сборной СПбГУ на протяжении 1 и 2 курса, то вы автоматически получаете зачёт по физкультуре.\n\n'
    '📄 Написание ИОП, индивидуальной образовательной программы, принесёт вам 200 баллов единоразово.\n'
    'О том, что такое ИОП и как её писать можно ознакомиться в Приложении 3 <a href="https://sport.spbu.ru/images/files/sport_rabochaya_programma.pdf">Рабочей программы дисциплины</a>.'
),
'olymp':(
    'Олимпиадная жизнь не заканчивается в школе! Для студентов ежегодно проводятся различные соревнования, в которых каждый как лично, так и в составе команды может показать свои способности и умения. \n\n'
    'Список олимпиад, актуальных для студентов-химиков:\n\n'
    '1. <b><a href="https://yandex.ru/profi/">"Я — профессионал"</a></b>\n'
    'Одна из самых известных олимпиад для студентов, охватывающая многие научные направления. Победители и призёры олимпиады претендуют на ценные призы, в числе которых бесплатные стажировки и денежные вознаграждения. Для участия необходимо пройти регистрацию на <a href="https://yandex.ru/profi/">сайте</a>, там же можно подробнее ознакомиться с регламентом проведения;\n\n'
    '2. <b><a href="https://www.herzen.spb.ru/about/struct-uni/fac/f-chem/o-fakultete/nauchnaya-deyatelnost/studencheskoe-nauchnoe-obshchestvo/vserossiyskaya-olimpiada-po-obshchey-khimii-dlya-studentov-1-i-2-kursov/">Всероссийская олимпиада по общей химии для студентов 1 и 2 курсов</a></b>\n'
    'Предварительный отбор участников олимпиады от Института проводит Алексей Юрьевич Тимошкин, анонс отбора размещается в группе <a href="https://vk.com/club15512628">Общая химия и неорганика</a>;\n\n'
    '3. <b><a href="https://technolog.edu.ru/universitet/olympics-competitions/regional_olympiad">Региональная олимпиада по химии для ВУЗов Санкт-Петербурга</a></b>\n'
    'Предварительный отбор участников проходит аналогичным образом;\n\n'
    '4. <b><a href="https://olymp.i-exam.ru/oo_chemistry">Открытая международная Интернет-олимпиада по дисциплине "Химия"</a></b>\n'
    'Данная олимпиада имеет особое преимущество в виде международного уровня, что в случае победы позволит вам претендовать на получение именной стипендии для обучающихся по ООП ВО.'
    ),
'mendel':(
    'Конференция для молодых ученых “Менделеев” традиционно проходит в стенах СПбГУ уже более 10 лет!\n\n'
    'Это масштабное мероприятие призванно освещать текущие результаты научно-исследовательской деятельности в области химических наук.\n'
    'Принять участие в нём могут студенты, аспиранты, а также молодые ученые возрастом до 35 лет.\n\n'
    'Помимо прочего, конференции каждый год требуются волонтёры! Если вы хотите потренировать разговорный английский, познакомиться с интересными людьми или посмотреть на организацию большого мероприятия изнутри, это ваш шанс! На время проведения конференции волонтёрам выдаются справки-освобождения от учёбы, а также мерч конференции. Объявление о наборе волонтёров публикуется в <a href="https://vk.com/mendeleev.spbu?w=club174872915">официальной группе ВКонтакте</a>.'
    'Больше информации можно найти на <a href="https://events.spbu.ru/events/mendeleev-2024">официальном сайте</a> конференциии.\n\n'
),
'ten': (
    'Международный Турнир естественных наук (ТЕН) — студенческое соревнование по решению междисциплинарных научно-исследовательских задач по химии, биологии, физике, медицине и инженерии.\n\n'
    'ТЕН является отборочным раундом на Grand Final of International natural sciences tournament и входит в перечень мероприятий Открытой международной олимпиады Санкт-Петербургского государственного университета среди студентов и молодых специалистов "Petropolitan Science (Re)Search".\n\n'
    'Участники Турнира — студенты очной формы обучения, осваивающие основные образовательные программы бакалавриата, магистратуры, специалитета.\n\n'
    'Турнир состоит из Отборочного и Заключительного этапов. \nСтатус Турнира — Международный; \nязык Турнира — Русский.\n\n'
    'Отборочный этап Турнира — это онлайн-соревнование.\n'
    'Заключительный этап традиционно проходит в ноябре на базе СПбГУ.\n\n'
    'Более подробная информация об участии размещена на <a href="https://scitourn.ru/">сайте</a> и в <a href="https://vk.com/scitourn_ru">офицальной группе ВКонтакте</a>.'
),
'aktiv': (
    'Жизнь в Университете не ограничивается одними лишь учёбой и наукой. Существуют всевозможные студенческие объединения, как локальные, так и на общеуниверситетском уровне. Благодаря им вы сможете обрести различные навыки, а также новые знакомства. \n\nС основными студенческими активностями вы можете ознакомиться ниже:'
),
'SS':(
    'Студенческий совет Института химии — это орган студенческого самоуправления, в состав которого могут входить обучающиеся со всех курсов бакалавриата и магистратуры.\n\n'
    'Его деятельность влияет на жизнь и учёбу обучающихся, поскольку Студсовет является связующим звеном между студенческим сообществом и администрацией Института. Если вам потребуется помощь в каком-либо вопросе, вы всегда можете обратиться в Студсовет!\n\n'
    'Подробнее вы можете ознакомиться в <a href="https://vk.com/chemstudsovet">офицальной группе Вконтакте</a>.'
),
'PB':(
    'Профсоюзная организация студентов и аспирантов Института химии (Профбюро) занимается в первую очередь организацией культурно-массовых мероприятий таких как День первокурсника, День химика, Новый год и тд.\n\n'
'Если вы являетесь творческим человеком, поёте, танцуете, или же просто имеете развитую фантазию, и готовы поучаствовать в проведении праздников в Институте, смело пишите <a href="https://vk.com/powercfghoff">Кириллу</a>.\n\n'
'Также члены Профбюро претендуют на материальную помощь в тяжёлой жизненной ситуации и баллы на ПГАС.\n\n'
'Стать членом Профбюро можно, подав заявление, которое можно получить у представителей организации. \nПодробнее — в <a href="https://vk.com/profchem">офицальной группе ВКонтакте</a>.'
),
'SNO':(
    'Студенческое научное общество (СНО) — это студенческая организация, деятельность которой направлена на помощь и поддержку будущим учёным.\n\n'
    'В задачи СНО входит поиск источников финансирования студенческих проектов, информирование о всевозможных стажировках и конкурсах, в которых могут участвовать студенты, организация встреч с представителями различных компаний, предоставляющих вакансии выпускникам.\n\n'
    'Подробнее — в <a href="https://vk.com/chemsno">офицальной группе ВКонтакте</a>.'
),
'stipsobsh': (
    'Каждый студент может претендовать на получение различных денежных выплат во время обучения в Университете. Их существует несколько видов, подробнее узнать о каждом можно ниже:'
),
'stipst': (
'<b>1. Стипендия для первокурсников от КНВШ</b>\n'
'<i>Вероятно, самая полезная стипендия для первокурсников.</i>\n'
'Кто претендует: студенты первого курса образовательных организаций Санкт-Петербурга, обучающиеся на бюджетной основе, имеющие заслуги в научной и образовательной деятельности.\n'
'🗓️Сроки подачи: июль-август;\n'
'💵Размеры выплаты (руб): 6000.\n'
'<a href="http://knvsh.gov.spb.ru/contests/view/419/">Подробнее</a> \n\n'
'<b>2. Благотворительный фонд Алексея Станина</b>\n'
'Кто претендует: студенты, имеющие гражданство РФ, обучающиеся на бюджетной основе по программам бакалавриата. При этом студенты должны учиться на оценки "C"(“Xорошо”) и выше. Помимо всего прочего необходимо иметь научные достижения (выступления на конференциях и научные статьи).\n'
'🗓️Сроки подачи: обычно середина апреля;\n'
'💵Размеры выплаты (руб): от 8000.\n'
'<a href="https://fondstanina.org/leti">Подробнее</a> \n\n'
'<b>3. Благотворительный фонд Владимира Потанина</b>\n'
'Кто претендует: обучающиеся любой формы финансирования по образовательным программам  <u>магистратуры</u>. \nСтуденты должны иметь выдающиеся успехи в учёбе и научной работе.\n'
'🗓️Сроки подачи: начало второго семестра;\n'
'💵Размеры выплаты (руб): 25000.\n'
'<a href="https://fondpotanin.ru/">Подробнее</a> \n\n'
'<b>4. Фонд поддержки молодых ученых имени Геннадия Комиссарова</b>\n'
'Кто претендует: студенты, которые учатся на оценки "C"(“Xорошо”) и выше. При этом студент должен быть работать над собственным сформулированным проектом в лаборатории на кафедре.\n'
'🗓️Сроки подачи: всегда по-разному — нужно следить за информацией на сайте;\n'
'💵Размеры выплаты (руб): 20000.\n'
'<a href="https://komissarov-foundation.ru/molodye-uchenye/">Подробнее</a>'
),
'matpom': (
    'Материальная помощь назначается студентам, оказавшимся в различных жизненных ситуациях.\nЧаще всего студенты возмещают часть средств, потраченных на билеты домой в каникулярный период.\n\n'
    'С правилами получения матпомощи и критериями её назначения можно ознакомиться на <a href="https://students.spbu.ru/mmen-stipendii/materialnaya-pomoshch.html">сайте</a>.\n\n'
    '❗Однако имеется ряд важных деталей:\n\n'
    '1. Материальная помощь выплачивается трижды в календарный год: один раз весной и два раза осенью;\n\n'
    '2. При подаче на материальную помощь нельзя иметь долгов за проживание в общежитии, а также дисциплинарных взысканий, полученных в течение одного календарного года, в противном случае материальная помощь не будет выплачена;\n\n'
    '3. Если вы по каким-то причинам не сумели податься на матпомощь весной, но всё же хотите вернуть деньги за поездку домой на зимних каникулах, то смело подавайтесь на осеннюю матпомощь — вам обязательно вернут часть потраченных средств.\n\n'
    'Размеры выплат не фиксированные, обычно наибольшая сумма выплачивается в первый раз в осеннем семестре.'
),
'soviet': (
'Выбор научной группы - процесс сугубо индивидуальный. Однако предлагаем ряд советов, которые могут помочь в этом нелёгком деле:\n\n'
'1. <b>Не торопитесь</b>. Этот совет, в принципе, работает практически везде, и выбор научной группы – не исключение. На первых порах может показаться, что у вас достаточно свободного времени, чтобы совмещать работу с учёбой, но, как правило, в дальнейшем возникают трудности.\n\n'
'2. <b>Старайтесь понять тематику исследований.</b> На многих производят впечатление такие вещи как, например, "тонкий органический синтез", "дизайн функциональных материалов" и тп. Однако не всегда люди всецело понимают, что на самом деле стоит за всеми этими вещами.\n\n'
'3. <b>Общайтесь с реальными людьми.</b> Вне зависимости от того, что вам рассказали на экскурсии или что вы прочитали на сайте, стоит пообщаться со студентами, уже работающими в данной группе, это самый достоверный источник. Не бойтесь спрашивать обо всём.\n\n'),

'stips': (
'<b>1. Государственная Академическая Стипендия (ГАС)</b>\n'
'Государственная академическая стипендия (ГАС) начинает начисляться сразу с момента поступления. Её выплата приостанавливается на семестр, если на сессии вы получили оценку ниже "C"("хорошо"). У иностранцев даже в таком случае стипендия остаётся.\n'
'💵Размеры выплаты (руб): 2284.\n\n'
'<b>2. Повышенная Государственная Академическая Стипендия (ПГАС)</b>\n'
'Кто претендует: студенты, обучающиеся по основным образовательным программам бакалавриата и магистратуры, имеющие особые достижения в учебной, научно-исследовательской, общественной, культурно-творческой и спортивной деятельности.\n'
'🗓️Сроки подачи: начало каждого семестра;\n'
'💵Размеры выплаты (руб): в среднем от 9000 до 13000.\n'
'<a href="https://students.spbu.ru/mmen-stipendii/stipendii/povyshennaya-akademicheskaya-stipendiya.html">Подробнее</a> \n\n'
'<b>3. Стипендия имени М.В. Ломоносова</b>\n'
'Кто претендует: обучающиеся, осуществляющие научную деятельность в области химических наук и смежных дисциплин.\n'
'До участия в конкурсном отборе на соискание стипендии допускаются обучающиеся СПбГУ по основным образовательным программам бакалавриата и магистратуры, получившие по итогам промежуточной аттестации в течение двух семестров подряд, предшествующих назначению стипендии, оценки "A"("отлично").\n'
'🗓️Сроки подачи: начало каждого семестра;\n'
'💵Размеры выплаты (руб): 5000.\n'
'<a href="https://students.spbu.ru/mmen-stipendii/stipendii/zayavki-na-imennye-i-personalnye-stipendii-dlya-obuchayushchikhsya-spbgu.html">Подробнее</a> \n\n'
'<b>4. Социальная стипендия</b>\n'
'Кто претендует: студенты, обучающиеся на бюджетной основе, относящиеся к льготным категориям.\n'
'<i>Лайфхак для иногородних</i>:\n'
'Студенты, получавшие государственную социальную помощь, являются одной из категорий, претендующих на эту стипендию. Чтобы войти в данную категорию достаточно получить <a href="https://gu.spb.ru/188129/">материальную помощь от государства</a> как иногороднему студенту. После получения соответствующего документа, который подтверждает то, что вы получали помощь от правительства, вы можете смело подаваться на социальную стипендию.\n'
'🗓️Сроки подачи: начало каждого семестра;\n'
'💵Размеры выплаты (руб): от 3500.\n'
'<a href="https://students.spbu.ru/mmen-stipendii/stipendii/73-sotsialnaya-stipendiya.html">Подробнее</a> \n\n'
'<b>5. Повышенная социальная стипендия для студентов 1-2 курсов</b>\n'
'Кто претендует: студенты первого и второго курсов, обучающиеся на бюджетной основе по программам бакалавриата, имеющие оценки успеваемости "C" ("Хорошо") и выше, и относящиеся к категории лиц, имеющих право на получение государственной социальной стипендии.\n'
'🗓️Сроки подачи: начало каждого семестра;\n'
'💵Размеры выплат (руб): 25000.\n'
'<a href="https://students.spbu.ru/mmen-stipendii/stipendii/povyshennaya-sotsialnaya-stipendiya-dlya-studentov-1-2-kursov.html">Подробнее</a>')
}