org_txt: dict[str, str] = {
    'opisanie': ('Здесь вы можете ознакомиться с научными группами кафедры органической химии.'),

    'balova':(
    '<b>"Химия ацетиленовых соединений"</b>\n\n'
    '<i>Руководитель группы</i> - Балова Ирина Анатольевна\n\n'
    '<i>Тематики исследований:</i>\n'
    'Циклоалкины, ендиины, этинилгетероциклы, гетероциклы, флуоресцентные красители, биоимиджинг.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Синтезом новых органических соединений, изучением их свойств, изучением новых реакций.\n\n'
    'Курсовая работа по органической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> n.danilkina@spbu.ru'),

    'bolotin':(
    '<b>Лаборатория нековалентного органокатализа</b>\n\n'
    '<i>Руководитель группы</i> - Болотин Дмитрий Сергеевич\n\n'
    '<i>Тематика исследований:</i>\n'
    'Изучение возможности использования органических кислот Льюиса в области активации малых молекул и в смежных областях.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    '"Первый год работы в нашей группе студенты отрабатывают навыки органического синтеза, проведения физико-химических исследований реакций, а также отрабатывают навыки публичных выступлений (создание презентаций и ораторское мастерство)."\n\n'
    'Курсовая работа по физической химии ✅\n'
    'Курсовая работа по органической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> https://vk.com/bolotind'
    ),
    'khleb':(
    '<b>"Химия напряжённых азотсодержащих гетероциклов в молекулярном дизайне"</b>\n\n'
    '<i>Руководитель группы</i> - Хлебников Александр Феодосиевич\n\n'
    '<i>Тематики исследований:</i>\n'
    'Химия напряженных азотсодержащих гетероциклических соединений;\n'
    'N-илиды, карбены, радикалы и другие интермедиаты: генерирование и использование в гетероциклическом синтезе;\n'
    'Мультикатализ в синтезе гетероциклов;\n'
    'Направленный синтез соединений с полезными свойствами.'
    '<i>Чем будет заниматься студент?</i>\n'
    'Разработкой новых методов органического синтеза\n\n'
    'Курсовая работа по органической химии ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> a.khlebnikov@spbu.ru'
    ),
    'ledov':(
    '<b>Научная группа тонкого органического синтеза</b>\n\n'
    '<i>Руководитель группы</i> - Ледовская Мария Сергеевна\n\n'
    '<i>Тематики исследований:</i>\n'
    'Группа занимается исследованиями реакций 1,3-диполярного циклоприсоединения и [4+2]-циклоприсоединения с участием алкинов и алкенов, в частности - тех, которые могут выступать в качестве суррогатов ацетилена.\nТекущая деятельность научной группы включает в себя, помимо всего прочего, выполнение двух проектов, направленных на разработку флуоресцентных красителей и полимерного носителя для фармпрепаратов с ОН-группой.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Разработкой новых синтетических подходов к широкому спектру гетероциклических соединений, включая фармпрепараты и/или флуоресцентные красители\n\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> m.s.ledovskaya@spbu.ru'
    ),
    'rodyg':(
    '<b>Научная группа Константина Родыгина</b>\n\n'
    '<i>Руководитель группы</i> - Родыгин Константин Сергеевич\n\n'
    '<i>Тематики исследований:</i>\n'
    'Электрохимический синтез органических соединений, катализ, химия терпенов и других природных соединений, 3D печать, получение биотоплива, искусственный интеллект, "зеленая" химия и химия в интересах устойчивого развития.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Работой на 3D принтере, получением и испытанием новых материалов,квантово-химическими расчетами.\n\n'
    'Курсовая работа по органической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> k.rodygin@spbu.ru'
    ),
    'zenkev':(
    '<b>Научная группа хроматографической и хромато-масс-спектрометрической идентификации органических соединений</b>\n\n'
    '<i>Руководитель группы</i> - Зенкевич Игорь Георгиевич\n\n'
    '<i>Тематики исследований:</i>\n'
    'Идентификация неизвестных соединений, хроматографический анализ нестабильных веществ, выявление образования гидратов в условиях обращенно-фазовой ВЭЖХ.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Работой по одному из указанных направлений.\n\n'
    'Курсовая работа по аналитической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    '<i>Контакт для связи:</i> izenkevich@yandex.ru'
    ),
    'rostov':(
    '<b>Научная группа химии азотистых гетероциклов</b>\n\n'
    '<i>Руководитель группы</i> - Ростовский Николай Витальевич\n\n'
    '<i>Тематики исследований:</i>\n'
    'Разработка новых методов синтеза пяти- и шестичленных азотсодержащих гетероциклических соединений на основе превращений ациклических непредельных субстратов (реакции енинонов, азиридинов и др.);\n'
    'Исследование реакционной способности и возможностей практического применения получаемых гетероциклов.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Органическим синтезом.\n\n'
    'Курсовая работа по органической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> a.pankova@spbu.ru'
    )
}

anal_txt: dict[str, str] = {
    'opisanie': ('Здесь вы можете ознакомиться с научными группами кафедры аналитической химии.'),
    'ermak':(
    '<b>Научная группа электрохимических методов анализа и амперометрических сенсоров</b>\n\n'
    '<i>Руководитель группы</i> - Ермаков Сергей Сергеевич\n\n'
    '<i>Тематика исследований:</i>\n'
    'Разработка амперометрических сенсоров для медицинской диагностики.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Экспериментальной работа, связанная с изучением аналитических возможностей амперометрических сенсоров.\n\n'
    'Курсовая работа по аналитической химии ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> s.ermakov@spbu.ru'),

    'bulatov':(
    '<b>"Методы разделения и концентрирования"</b>\n\n'
    '<i>Руководитель группы</i> - Булатов Андрей Васильевич\n\n'
    '<i>Тематики исследований:</i>\n'
    'Химический анализ пищевых продуктов, нефтепродуктов, растительного сырья; микроэкстракция.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Работой по гранту: микроэкстракцией, хроматографией.\n\n'
    'Курсовая работа по аналитической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> bulatov_andrey@mail.ru'),

    'SSS':(
    '<b>"Методы атомного спектрального анализа и ядерная гамма резонансная спектроскопия"</b>\n\n'
    '<i>Руководитель группы</i> - Савинов Сергей Сергеевичы\n\n'
    '<i>Тематики исследований:</i>\n'
    'Атомно-эмиссионная и атомно-абсорбционная спектрометрия: оптимизация цифровой регистрации спектров и расчета аналитического сигнала, разработка схем анализа реальных объектов и их практическое применение, определение эссенциальных и токсичных элементов в биологических, природных и технологических объектах.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Разработкой схемы определения металлов в реальных объектах методами атомной спектрометрии (пробоподготовка, измерение сигнала, обработка результатов).\n'
    'Конкретная тематика может как задаваться преподавателем, так и предлагаться самим студентом.\n\n'
    'Курсовая работа по аналитической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    '<i>Контакт для связи:</i> s.s.savinov@spbu.ru'),

    'kirsanov':(
    '<b>Лаборатория прикладной(карательной) хемометрики</b>\n\n'
    '<i>Руководитель группы</i> - Кирсанов Дмитрий Олегович\n\n'
    '<i>Тематики исследований:</i>\n'
    '- Применение методов машинного обучения в химии (хемометрика);\n'
    '- Обработка результатов спектроскопических, хроматографических и сенсорных измерений;\n'
    '- Электрохимические и оптические мультисенсорные системы;\n'
    '- Решение различных прикладных аналитических задач.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    '"Тематика работ определяется текущими проектами группы, есть возможность выбора между расчётной работой и экспериментальной."'
    'Курсовая работа по аналитической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> d.kirsanov@gmail.com'),

    'penkova':(
    '<b>Группа мембранных материалов и мембранных методов разделения</b>\n\n'
    '<i>Руководитель группы</i> - Пенькова Анастасия Владимировна\n\n'
    '<i>Тематики исследований:</i>\n'
    'Водоочистка, разработка композитных полимерных материалов\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Разработкой мембранных фильтрационных материалов, разработкой пищевой биоупаковки.'
    'Курсовая работа по аналитической химии ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> a.penkova@spbu.ru'),

    'shishov':(
    '<b>Лаборатория изучения биологически активных растительных веществ</b>\n\n'
    '<i>Руководитель группы</i> - Шишов Андрей Юрьевич\n\n'
    '<i>Тематики исследований:</i>\n'
    'Научная группа занимается извлечения биологически активных веществ из растительного сырья с применением глубоких эвтектических растворителей.\n'
    'Полученные экстракты используются и для идентификации и выделения БАВ и для изготовления новых лекарственных препаратов на их основе.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Изготовлением и изучением свойств глубоких эвтектических растворителей, пробоподготовкой растительного сырья, экстракцией, изучением химического состава и биологической активности экстрактов.'
    'Курсовая работа по аналитической химии ✅\n'
    'Курсовая работа по физической химии ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> https://vk.com/andreishishov'),

}

phys_txt: dict[str, str] = {
    'opisanie': ('Здесь вы можете ознакомиться с научными группами кафедры физической химии.'),
    'viktor':(
    '<b>"Физическая химия мягкой материи"</b>\n\n'
    '<i>Руководитель группы</i> - Викторов Алексей Исмаилович\n\n'
    '<i>Тематики исследований:</i>\n'
    'Самосборка мягких наноструктур, ионные жидкости, мицеллярные растворы, микроэмульсии, блоксополимеры, физические гели на основе ассоциирующих полимеров, полиэлектролиты, структура и макроскопические свойства;\n'
    'Эксперимент, теория, компьютерное моделирование\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Синтезом, экспериментом, моделированием.\n\n'
    'Курсовая работа по физической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> e.a.safonova@spbu.ru'),

    'solov':(
    '<b>Лаборатория плазмонно усиленной спектроскопии и биоимиджинга</b>\n\n'
    '<i>Руководитель группы</i> - Соловьева Елена Викторовна\n\n'
    '<i>Тематики исследований:</i>\n'
    '1. Разработка оптических меток и агентов тераностики для лечебной фотодинамической и гипертермальной терапии на основе наночастиц золота;\n'
    '2. Развитие аналитических приложений спектроскопии гигантского комбинационного рассеяния света.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Синтезом наночастиц золота и получением гибридных материалов на их основе, исследованием их спектральных свойств (флуоресценция, комбинационное рассеяние), проведением биотехнологических экспериментов с живыми клетками (биовизуализация, оценка цитотоксичности, маркеров окислительного стресса).\n\n'
    'Курсовая работа по физической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> e.solovieva@spbu.ru'),

    'peshkova':(
    '<b>Группа оптических сенсоров</b>\n\n'
    '<i>Руководитель группы</i> - Пешкова Мария Анатольевна\n\n'
    '<i>Тематики исследований:</i>\n'
    'Изучение механизмов функционирования и принципов применения полимерных оптических сенсоров; разработка новых концепций оптических сенсоров; применение оптических сенсоров в составе устройств для анализа реальных объектов.\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Спектрофотометрией растворов и тонких пленок, изготовлением полимерных датчиков, цифровой колориметрией; компьютерным моделированием оптического отклика.\n\n'
    'Курсовая работа по физической химии ✅\n'
    'Курсовая работа по аналитической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> maria.a.peshkova@gmail.com'),

    'mikhelson':(
    '<b>"Электрохимические сенсоры на основе ионофоров"</b>\n\n'
    '<i>Руководитель группы</i> - Константин Николаевич Михельсон\n\n'
    '<i>Тематики исследований:</i>\n'
    'Исследование механизма функционирования электрохимических сенсоров на основе ионофоров.\n'
    'Анализ возможностей их применения в токовых режимах.\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Изготавливать ионоселективные электроды различных конструкций и проводить с ними потенциометрические, хронопотенциометрические, импедансные, вольтамперометрические и хронамперометрические измерения.\n'
    'Анализировыать полученные результаты и сопоставлять их с литературными данными.\n\n'
    'Курсовая работа по физической химии ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> Konstantin_Mikhelson@outlook.com'),

    'voznes':(
    '<b>Группа численного исследования нанообъектов и наноструктурированных систем</b>\n\n'
    '<i>Руководитель группы</i> - Вознесенский Михаил Андреевич\n\n'
    '<i>Тематики исследований:</i>\n'
    '1) Квантовые расчеты электронной структуры твердого тела и поиск взаимосвязи с физико-химическими процессами;\n'
    '2) Моделирование физико-химических процессов в рамках классической механики и разработка моделей для этого. \n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Проводить квантовые расчеты в программных пакетах и/или писать программы, реализующие модели и алгоритмы, в том числе тестировать корректность работы программ, анализ результатов моделирования, сравнение с известными экспериментальными результатами.\n\n'
    'Курсовая работа по физической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> m.voznesenskiy@spbu.ru'),

    'sizov':(
    '<b>Группа компьютерного моделирования</b>\n\n'
    '<i>Руководитель группы</i> - Сизов Владимир Викторович\n\n'
    '<i>Тематики исследований:</i>\n'
    'Применение методов вычислительной химии (молекулярная динамика, Монте-Карло, квантовохимические расчеты) для решения следующих задач:\n'
    '1) Адсорбция и диффузия в пористых материалах;\n'
    '2) Агрегация и поверхностные явления в растворах ПАВ;\n'
    '3) Строение и устойчивость газогидратных систем;\n'
    '4) Электронное строение и свойства координационных соединений. \n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Освоением вычислительных методов и соответствующего программного обеспечения, работой в рамках одного из существующих направлений исследований группы. \n\n'
    'Курсовая работа по физической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> v.sizov@spbu.ru')

}

oinch_txt: dict[str, str] = {
    'opisanie': ('Здесь вы можете ознакомиться с научными группами кафедры аналитической химии.'),
    'timosh':(
    '<b>Научная группа донорно-акцепторных взаимодействий</b>\n\n'
    '<i>Руководитель группы</i> - Тимошкин Алексей Юрьевич\n\n'
    '<i>Тематика исследований:</i>\n'
    'Экспериментальное и теоретическое исследование донорно-акцепторных комплексов во всех агрегатных состояниях; кислоты и суперкислоты Льюиса с перфторированными заместителями, неорганические галогениды.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Синтезом, очисткой и характеризацией соединений, проведением тензиметрических измерений и квантово-химических расчетов.\n\n'
    'Курсовая работа по неорганической химии ✅\n'
    'Курсовая работа по физической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> timoshkn@gmail.com'),

    'grach':(
    '<b>"Люминесцентные комплексы для оптоэлектроники"</b>\n\n'
    '<i>Руководитель группы</i> - Грачева Елена Валерьевна\n\n'
    '<i>Тематика исследований:</i>\n'
    'Основная работа направлена на решение проблем контролируемого синтеза комплексов заданного состава и на изучение фотофизических свойств молекулярных эмиттеров и люминесцентных молекулярных материалов на их основе.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Неорганическим и органическим синтезом, спектральной характеризацией соединений и супрамолекулярных структур, исследованием их фотофизических свойств.\n\n'
    'Курсовая работа по неорганической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> e.grachova@spbu.ru'),

    'osmol':(
    '<b>Группа синтеза и исследования наночастиц и наноструктурированных материалов</b>\n\n'
    '<i>Руководитель группы</i> - Осмоловская Ольга Михайловна\n\n'
    '<i>Тематика исследований:</i>\n'
    '"Мы занимаемся исследованием закономерностей формирования неорганических наночастиц при их синтезе из растворов, пониманием связи между особенностями наночастиц и проявляемыми ими свойствами, созданием неорганических, гибридных и композиционных материалов на основе получаемых наночастиц."\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Неорганическим и органическим синтезом, спектральной характеризацией соединений и супрамолекулярных структур, исследованием их фотофизических свойств.\n\n'
    'Курсовая работа по неорганической химии ✅\n'
    'Курсовая работа по физической химии ✅\n'
    'Курсовая работа по аналитической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> info@nanolabspb.ru'),

    'stol':(
    '<b>Группа высокотемпературной химии оксидных систем и материалов</b>\n\n'
    '<i>Руководитель группы</i> - Столярова Валентина Леонидовна\n\n'
    '<i>Тематика исследований:</i>\n'
    'Tермодинамические свойства и процессы испарения оксидных систем и материалов (стекол, керамики, покрытий) при высоких температурах;\n'
    'Моделирование термодинамических свойств оксидных систем: рассмотрение корреляций со структурой при получении материалов с заданными свойствами;\n'
    'Прогнозирование физико-химических свойств новых материалов при высоких температурах.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    '- Расчетом фазовых диаграмм оксидных систем с использованием базы данных NUCLEA;\n'
    '- Экспериментальным изучением термодинамических свойств оксидных систем до температур 3000 К методом высокотемпературной масс-спектрометрии;\n'
    '- Сопоставлением экспериментальных и рассчитанных значений термодинамических свойств в оксидных системах с использованием полуэмпирических и статистико-термодинамических моделей.\n\n'
    'Курсовая работа по неорганической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> v.stolyarova@spbu.ru'),

    'skip':(
    '<b>Лаборатория химии растворов</b>\n\n'
    '<i>Руководитель группы</i> - Скрипкин Михаил Юрьевич\n\n'
    '<i>Тематика исследований:</i>\n'
    'Строение многокомпонентных водных растворов, равновесие раствор - твердая фаза в многокомпонентных системах;\n'
    'Влияние состава раствора на состав и свойства кристаллизующейся твердой фазы, в том числе на фотофизические свойства металл-органических каркасных структур, содержащих ионы РЗЭ, и твердых растворов на основе фторидов РЗЭ;\n'
    'Коррозия конструкционных  материалов при контакте с водными растворами.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Изучением свойств растворов, в том числе твердых растворов;\n'
    'Синтезом МОФ различного состава.\n\n'
    'Курсовая работа по неорганической химии ✅\n'
    'Курсовая работа по физической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> skripkin1965@yandex.ru')

    }

physorg_txt: dict[str, str] = {
    'opisanie': ('Здесь вы можете ознакомиться с научными группами кафедры физической органической химии.'),

    'tolstoy':(
    '<b>Лаборатория невалентных взаимодействий</b>\n\n'
    '<i>Руководители группы</i> - Толстой Пётр Михайлович, Тупикина Елена Юрьевна\n\n'
    '<i>Тематика исследований:</i>\n'
    'Исследование систем с невалентными взаимодействиями - водородными, галогенными, халькогенными, пи-пи и др.\n'
    'Основная идея - использование комплексного подхода, а именно проведение исследований полного цикла - от синтеза интересующих соединений, через спектральную характеризацию, к теоретическому описанию механизмов образования интересующих взаимодействий.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    '1. Синтеом элементоорганических соединений.\n'
    '2. Исследованиемм строения нековалентносвязанных ассоциатов методами спектроскопии ЯМР.\n'
    '3. Квантово-механическим моделированием систем с невалентными взаимодействиями.\n\n'
    'Курсовая работа по физической химии ✅\n'
    'Курсовая работа по органической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> elenatupikina@gmail.com'),

    'Boyarskiy':(
    '<b>BoyarskiyLab: Гетероциклические полинуклеофилы и комплексы платиновых металлов на их основе</b>\n\n'
    '<i>Руководитель группы</i> - Боярский Вадим Павлович\n\n'
    '<i>Тематика исследований:</i>\n'
    'Синтез азагетероциклов для биомедицинских приложений и дизайна металлокомплексных катализаторов.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'В зависимости от желания и склонностей студента и существующих проектов: экспериментальная работа в области органического синтеза, гомогенного металлокомплексного катализа или координационной химии.\n\n'
    'Курсовая работа по неорганической химии ✅\n'
    'Курсовая работа по органической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> v.boiarskii@spbu.ru'),

    'kinzhal':(
    '<b>Научная группа Кинжалова Михаила Андреевича</b>\n\n'
    '<i>Руководитель группы</i> - Кинжалов Михаил Андреевич\n\n'
    '<i>Тематика исследований:</i>\n'
    'Научная группа специализируется на химии благородных металлов и проведении практико-ориентированных исследований по разработке лекарственных препаратов нового поколения, светоизлучающих материалов и катализаторов органических процессов.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Разработкой лекарственных препаратов нового поколения, светоизлучающих материалов и катализаторов органических процессов на основе элементоорганических соединений благородных металлов.\n\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> m.kinzhalov@spbu.ru'),

    'ivanov':(
    '<b>"Нековалентные взаимодействия в твёрдой фазе"</b>\n\n'
    '<i>Руководитель группы</i> - Иванов Даниил Михайлович\n\n'
    '<i>Тематики исследований:</i>\n'
    '- Нековалентные взаимодействия в твёрдой фазе и растворе, в том числе с участием атомов металлов;\n'
    '- Инженерия кристаллов и построение супрамолекулярных структур;\n'
    '- Координационная химия металлов платиновой группы и золота;\n'
    '- Реакционная способность лигандов.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Синтезом и кристаллизацией координационных и органических соединений, проведением релевантных квантово-химических расчётов, представлением полученных результатов на конференциях, написанием научных статей.\n\n'
    'Курсовая работа по неорганической химии ✅\n'
    'Курсовая работа по физической химии ✅\n'
    'Курсовая работа по органической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> d.m.ivanov@spbu.ru'),
}

termkin_txt: dict[str, str] = {
    'opisanie': ('Здесь вы можете ознакомиться с научными группами кафедры химической термодинамики и кинетики.'),

    'toikka':(
    '<b>"Термодинамические и кинетические исследования фазовых, мембранных, реакционно-массообменных неравновесных процессов и критических состояний"</b>\n\n'
    '<i>Руководитель группы</i> - Тойкка Александр Матвеевич\n\n'
    '<i>Тематики исследований:</i>\n'
    '- Общая, неравновесная и химическая термодинамика;\n'
    '- Экспериментальные исследования фазовых переходов, трансмембранного переноса, критических явлений в многокомпонентных системах с химических взаимодействием;\n'
    '- Теория термодинамической устойчивости, методы неравновесной термодинамики, квантовой химии, классической и неэмпирической молекулярной динамики, искусственных нейронных сетей.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'В зависимости от интересов: экспериментальными и/или теоретико-расчетными исследования, в соответствии с указанной тематикой группы.\n\n'
    'Курсовая работа по физической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> a.toikka@spbu.ru'),

    'pulyalina':(
    '<b>"Термодинамические и кинетические исследования мембранных процессов</b>\n\n'
    '<i>Руководитель группы</i> - Пулялина Александра Юрьевна\n\n'
    '<i>Тематики исследований:</i>\n'
    '- Изучение особенности массопереноса через мембраны при решении актуальных практических задач;\n'
    '- Разработка новых мембранных материалов;\n'
    'Прогнозирования свойств мембран для процессов разделения жидких и газовых сред.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Оптимизацией способов получения мембран, анализом литературы, детальным изучением структуры новых материалов; анализом физико-химических свойств мембран; проведением экспериментов по решению практически значимых задач в области очистки и регенерации целевых компонентов.\n\n'
    'Курсовая работа по неорганической химии ✅\n'
    'Курсовая работа по физической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    '<i>Контакт для связи:</i> alexandra.pulyalina@gmail.com'),

    'zvereva':(
    '<b>"Синтез и термодинамико-кинетические исследования процессов в материалах для катализа, фотокатализа, энергетики, энерго- и ресурсосберегающих экологически чистых технологий."</b>\n\n'
    '<i>Руководитель группы</i> - Зверева Ирина Алексеевна\n\n'
    '<i>Тематики исследований:</i>\n'
    '- Синтез и исследование наноструктурированных систем (преимущественно перовскитоподобных оксидов, цеолитов, слоистых структур);\n'
    '- Изучение фотокаталитических и каталитических процессов;\n'
    '- Создание фотокатализаторов и катализаторов для практически значимых процессов (получение водорода, процессы нефтехимического синтеза, переработки биомассы, очистки воды);\n'
    '- Изучение кинетики и механизмов твердофазных реакций;\n'
    '- Создание новых наноструктурированных неорганических и гибридных органо-неорганических материалов.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Синтезом и исследованием новых фотокатализаторов и пьезофотокатализаторов для процессов получения водорода и окисления различных полютантов, включая антибиотики.\n\n'
    'Курсовая работа по неорганической химии ✅\n'
    'Курсовая работа по физической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    '<i>Контакт для связи:</i> irina.zvereva@spbu.ru ')
}

colloid_txt: dict[str, str] = {
    'opisanie': ('Здесь вы можете ознакомиться с научными группами кафедры коллоидной химии.'),

    'noskov':(
    '<b>"Поверхностные явления в наногетерогенных жидкостях"</b>\n\n'
    '<i>Руководитель группы</i> - Носков Борис Анатольевич\n\n'
    '<i>Тематика исследований:</i>\n'
    'Поверхностные явления в сложных жидкостях, прежде всего в растворах биомакромолекул и в водных дисперсиях наночастиц различной химической природы.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    '"Научная группа обладает наиболее полным набором методов для исследования поверхностных явлений в жидкости среди других групп в России, и, по-видимому, в Восточной Европе.\n'
    'Все имеющееся оборудование может быть использовано студентами для исследования тонких слоев наночастиц, нуклеиновых кислот, белков, их агрегатов, включая амилоидные фибриллы, и комплексов с веществами различной химической природы."\n\n'
    'Курсовая работа по физической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> b.noskov@spbu.ru'),

    'rusanov':(
    '<b>"Термодинамика, поверхностные и электроповерхностные свойства наноповерхностных систем"</b>\n\n'
    '<i>Руководитель группы</i> - Русанов Анатолий Иванович\n\n'
    '<i>Тематики исследований:</i>\n'
    '- Синтез и изучение физико-химических свойств функциональных наночастиц (синтетических алмазов, композитных частиц на основе оксидов), устойчивость их водных дисперсий;\n'
    '- Компьютерное моделирование наноструктур.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Экспериментальным и теоретическим исследованем характеристик различных классов наноструктурированных материалов, подготовкой публикаций.\n\n'
    'Курсовая работа по физической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> anna.volkova@spbu.ru')
}

laser_txt: dict[str, str] = {
    'opisanie': ('Здесь вы можете ознакомиться с научными группами кафедры лазерной химии.'),

    'manshina':(
    '<b>Группа лазерного синтеза</b>\n\n'
    '<i>Руководитель группы</i> - Маньшина Алина Анвяровна\n\n'
    '<i>Тематика исследований:</i>\n'
    '- Лазерно-индуцированный синтез наноструктур и наноматериалов для различных применений в сенсорных технологиях (в том числе гибких сенсорах), биомедицине и энергетике;\n'
    '- Аддитивные 3D лазерные технологии и разработка новых материалов для лазерной печати;\n'
    '- Разработка новых фотопереключаемых, биоактивных и люминесцентных систем для фотофармакологии.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    '- С использованием лазеров синтезировать мульти-металлические наночастицы и исследовать их физико-химические и функциональные свойства;\n'
    '- Проводить процессы лазерного плавления/спекания различных исходных наноматериалов для получения 3D объектов;\n'
    '- Исследовать процессы фотопереключения свойств биоактивных молекул и гибридных наноструктур на их основе.\n\n'
    'Курсовая работа по неорганической химии ✅\n'
    'Курсовая работа по аналитической химии ✅\n'
    'Курсовая работа по физической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> a.manshina@spbu.ru'),

    'tver':(
    '<b>Группа лазерной спектроскопии и модификации материалов</b>\n\n'
    '<i>Руководитель группы</i> - Тверьянович Юрий Станиславович\n\n'
    '<i>Тематики исследований:</i>\n'
    '1. Пластичные неорганические полупроводниковые материалы для гибкой электроники;\n'
    '2. Получение водорода из природного газа под действием лазерного излучения;\n'
    '3. Исследование люминесцентных, нелинейно-оптических свойств халькогенидных стеклообразных полупроводников, возможности управления их свойствами за счет внешнего воздействия;\n'
    '4. Разработка гибридных молекулярно-плазмонных наноструктур для задач фотомедицины;\n'
    '5. Синтез люминесцентно-магнитных неорганических наночастиц фторидов лантаноидов и люминесцентных металл-органических каркасных структур (координационных полимеров) лантаноидов.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Синтезом полупроводниковых материалов, гибридных наночастиц, металл-органических каркасных структур лантаноидов, исследованием их физико-химических и функциональных свойств, подготовкой образцов для измерений в ресурсных центрах, обработкой результатов, написанием статей \n\n'
    'Курсовая работа по неорганической химии ✅\n'
    'Курсовая работа по аналитической химии ✅\n'
    'Курсовая работа по физической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> tys@bk.ru')

}

med_txt: dict[str, str] = {
    'opisanie': ('Здесь вы можете ознакомиться с научными группами кафедры медицинской химии.'),

    'KorzhVlakh':(
    '<b>Лаборатория биоматериалов</b>\n\n'
    '<i>Руководитель группы</i> - Коржиков-Влах Виктор Александрович\n\n'
    '<i>Тематика исследований:</i>\n'
    'Разработка систем доставки лекарств, тканевая инженерия и модификация живых клеток.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    '- Синтезом и модификацией  полимеров биомедицинского назначения;\n'
    '- Инкапсулированием лекарств;\n'
    '- Получением микро- и наночастиц на основе биосовместимых полимеров;\n'
    '- Получением материалов и изучением их структуры и свойств, в том числе биологических.\n\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> @ViktorKorzhVlakh')

}

vms_txt: dict[str, str] = {
    'opisanie': ('Здесь вы можете ознакомиться с научными группами кафедры химии высокомолекулярных соединений.'),

    'islam':(
    '<b>"Функциональные полисилоксаны и материалы на их основе"</b>\n\n'
    '<i>Руководитель группы</i> - Исламова Регина Маратовна\n\n'
    '<i>Тематики исследований:</i>\n'
    '- Силиконовые самозалечивающиеся материалы с люминесцентными, электроактивными и сенсорными свойствами;\n'
    '- Гибкие электропроводящие силиконовые композиты с углеродными нанонаполнителями;\n'
    '- Функционализированные полисилоксаны с антибактериальными или каталитическими свойствами.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    '- Синтезом мономеров и (со)полисилоксанов, проведением полимераналогичных превращений, модификацией нанонаполнителей, приготовлением полимерных композиционных материалов, получением сшитых силиконовых материалов, проведением гетерогенного катализа с помощью синтезируемых металлосодержащих полисилоксанов.\n'
    '- Анализом структуры и строения полимеров, определением молекулярной массы полимеров, изучением механических, люминесцентных, электрохимических и др. характеристик полимеров и материалов на их основе.\n\n'
    'Курсовая работа по органической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> r.islamova@spbu.ru')

}

electro_txt: dict[str, str] = {
    'opisanie': ('Здесь вы можете ознакомиться с научными группами кафедры электрохимии им. Трояны Кисслер.'),

    'kondratev':(
    '<b>"Электродные материалы для металл-ионных аккумуляторов, суперконденсаторов и редокс-батарей."</b>\n\n'
    '<i>Руководитель группы</i> - Кондратьев Вениамин Владимирович\n\n'
    '<i>Тематики исследований:</i>\n'
    '- Фундаментальные и прикладные исследования в области разработки новых энергозапасающих материалов для химических источников тока;\n'
    '- Катодные материалы для металл-ионных аккумуляторов (цинк-ионных и магний-ионных).\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Гидротермальным синтезом пред-интеркалированных оксидов ванадия, структурно-химической характеризацией и исследованием электрохимических свойств полученных катодных материалов.\n\n'
    'Курсовая работа по неорганической химии ✅\n'
    'Курсовая работа по аналитической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> v.kondratev@spbu.ru')

}

quant_txt: dict[str, str] = {
    'opisanie': ('Здесь вы можете ознакомиться с научными группами кафедры квантовой химии.'),

    'porsev':(
    '<b>"Квантовая химия наноструктур: электронные, колебательные и термодинамические свойства нанослоев, нанотрубок, нанопроводов и нанолент"</b>\n\n'
    '<i>Руководитель группы</i> - Эварестов Роберт Александрович\n\n'
    '<i>Тематики исследований:</i>\n'
    '- Магнитные группы симметрии одномерных структур;\n'
    '- Новые наноструктуры с винтовой симметрией;\n'
    '- Термодинамические и упругие свойства многостенных нанотрубок.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    '- Неэмпирическиеми расчетами различных свойств наноструктур различной размерности;\n'
    '- Разработкой молекулярно-механических полей и моделированием многостенных нанотрубок.\n\n'
    'Курсовая работа по физической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> v.porsev@spbu.ru')

}

htt_txt: dict[str, str] = {
    'opisanie': ('Здесь вы можете ознакомиться с научными группами кафедры химии твердого тела.'),

    'tolstoy':(
    '<b>"Программируемый послойный синтез мультислоёв гибридных соединений и создание новых функциональных наноматериалов на их основе"</b>\n\n'
    '<i>Руководитель группы</i> - Толстой Валерий Павлович\n\n'
    '<i>Тематика исследований</i> изложена на <a href="https://chem.spbu.ru/research/nauchnye-gruppy/237-scientific-activities/research-groups/2075-nauchnaya-gruppa-professora-v-p-tolstogo.html">сайте</a>.\n\n'
    '<i>Чем будет заниматься студент?</i>\n'
    'Создавать новые маршруты программируемого синтеза неорганических соединений.\n\n'
    'Курсовая работа по неорганической химии ✅\n'
    'Курсовая работа по физической химии ✅\n'
    'Курсовая работа по аналитической химии ✅\n'
    'Выпуская квалификационная работа ✅\n\n'
    'Возможность трудоустройства ✅\n\n'
    '<i>Контакт для связи:</i> v.tolstoy@spbu.ru ')

}