punk_txt: dict[str, str] = {
'punk': ('<b>ПУНК — Петродворцовый Учебно-Научный Комплекс</b> — место, где студенты-химики проводят большую часть своего времени.\n\n'
'Официально ПУНК — это все объекты СПбГУ, расположенные в Петергофе, однако зачастую среди студентов эта аббривеатура подразумевает в первую очередь общежития.'),
'chats': (
    'Здесь вы можете вступить в беседу вашего общежития.\n\n'
    'Данные беседы созданы для упрощения коммуникации между студентами, здесь вы можете попросить помощи, узнать о важных объявлениях или просто пообщаться с ребятами с других факультетов!\n\n'
    '🔵 <a href="https://vk.me/join/S2ox/B8MQL1WXxfQ0_fYeqOv8UrPY1bwgWc=">10 общежитие</a>\n'
    '🔵 <a href="https://vk.me/join/o0cWCHR83jF1zIWGbGQ9VgOaX6Fsvvz8e/M=">12 общежитие</a>\n'
    '🔵 <a href="https://vk.me/join/LDvAQhZtN09lUWUjSxaeHqRZnZW0OimYNHM=">13 общежитие</a>\n'
    '🔵 <a href="https://vk.me/join/7RBsWKuQHzCl00BdyACsVN0VrQh6n47ET68=">14 общежитие</a>\n'
    '🔵 <a href="https://vk.me/join/vCY9XzKGofZ_pNKuolwmI7pCKFqk0M_CZ/M=">15 общежитие</a>\n'
    '🔵 <a href="https://vk.me/join/QnsjbawCBkgt6X5FRnCwUe1dd5x6hfm4BRs=">16 общежитие</a>\n'
    '🔵 <a href="https://vk.me/join/5Z1Rc6xJyaUTimMBctf9SVqZchYJw1QDh34=">20-21 общежития</a>\n'
    '🔵 <a href="https://vk.me/join/_sFMO/N/7/9nkVvyqt9m1sSY8HDCK18zv7E=">22-23 общежития</a>\n'
),
'ZaZa':(
'Здесь вы можете вкратце узнать о том, как добраться до ПУНКа и как заселиться в общежитие.\n\n'
'Для получения более подробной информации рекомендуем также ознакомитсья с <a href="https://nice-unicorn-d85.notion.site/94699b1d99d74f16be2421f01b915497">гайдом</a> от Комитета по работе с общежитиями'
),
'road':(
'❗Стоит заранее установить на свой телефон приложение по типу <a href="https://help.2gis.ru/question/mobilnye-prilozheniya-2gis">2ГИС</a>, <a href="https://yandex.ru/support/m-maps/download.html">Яндекс</a> или <a href="https://www.google.ru/maps/?hl=ru">Google карт</a>, лишним оно никогда не будет.\n\n'
'Вне зависимости от того, с какого места в Санкт-Петербурге начинается ваш путь до ПУНКа, всегда имеется возможность добраться на такси.\n\n'
'Если вы добираетесь из аэропорта, то можно воспользоваться автобусом №39 (39э) и доехать до станции метро «Московская» или №82э до станции метро «Проспект Ветеранов», затем следовать указаниям ниже.\n\n'
'Существует два основных способа добраться до ПУНКа из города — <u>электричка</u> либо <u>автобус</u>. Для начала вам предстоит добраться на метро до одной из станций, указаных ниже, в зависимости от вида транспорта:\n\n'

),
'russ':(
'В первую очередь нужно подготовить все необходимые документы. \n\nПонадобятся:\n'
'1. Паспорт и его копия;\n'
'2. Справка (заключение) о результатах флюорографии (сроком не более 11 мес.) и её копия;\n'
'3. <a href="https://ria.ru/20230621/doverennost-1879633478.html#1879633478-1879633507">Доверенность</a> родителей для обучающихся, не достигших 18-летнего возраста;\n\n'
'<b>Как заселяться?</b>\n'
'❗Заселение проводится c 25 по 31 августа в период <b>с 8:00 до 20:00</b>.\nОднако! Не стоит приезжать ближе к вечеру, поскольку из-за большой очереди вас могут не успеть заселить. Приезжайте пораньше и будьте готовы к большому количеству заселяющихся.\n\n'
'При наличии необходимых документов ваш порядок действий при поселении следующий:\n'
'1. Получить временный пропуск в здании КПП. Сопровождающим лицам (не более 2 человек) при необходимости будут выданы разовые пропуски на один день до 23:00 при предъявлении паспорта;\n'
'2. Пройти в ваше общежитие для заселения. На входе в общежития вас встретят волонтеры, которые сориентируют вас и ответят на все вопросы;\n'
'3. Направиться к коменданту, чтобы заключить договор, получить ключи и по необходимости вещи (постель, настольную лампу и т.д.);\n\n'

'В течение двух недель необходимо сходить в отдел поселения, что находится в 10 общежитии, сделать постоянный пропуск (каб. 108) и временную регистрацию (каб. 113). Для этого понадобятся паспорт и договор найма жилого помещения, получаемый у коменданта.\n\n'
'❗Если у вас есть регистрация в Санкт-Петербурге или ЛО, то оформлять временную прописку не надо!'

),
'neruss':(
'Поселение в общежития в период с 25 по 31 августа будет осуществляться ежедневно (включая субботу и воскресенье) с 8:00 до 20:00. Поселение иностранцев платников будет осуществляться после 15 сентября.\n\n'
'Для поселения вам понадобятся следующие документы:\n'
'1. Паспорт;\n'
'2. Флюорография. Отдельная или внутри 086 формы (перевод не нужен), действительна в течении 11 месяцев;\n'
'3. Разрешение родителей на поселение (нотариально заверенное), если вам нет 18 лет.\n'
'Если родитель приезжает на заселение вместе с вами, то можно заполнить разрешение на поселение на месте.\n\n'
'По прибытии в ПУНК, подойдя к КПП, вам нужно будет оформить временный пропуск.\n'
'Сопровождающим лицам (не более 2 человек) при необходимости будут выданы разовые пропуски на один день до 23:00 при предъявлении паспорта.\n'
'Далее вам необходимо будет направиться в отдел поселения (10 общежитие), после чего вас распределят в ваше общежитие, куда и надо будет направиться далее.\n\n'
'На всех этапах вас будут встречать волонтеры, которые помогут сориентироваться и разобраться в процессе поселения.!\n\n'
'Также вам будет необходимо подать документы на постановку на миграционный учёт, пройти дактилоскопию (кроме граждан республики Беларусь) и медицинское освидетельствование.\n\n'
'Подробнее о процессе заселения, постановке на миграционный учёт и прохождении дактилоскопии и медосвидетельствования вы можете прочитать в <a href="https://vk.com/doc549692179_679215574?hash=5kZVlZH7a2xXnDzYN3beotjCbocpZURhKnb1BdR27BD&dl=vEDqYy4czSWFz06CJYRDRes1342DP7kBEAjltjYYYD4">файле</a>, подготовленным Клубом Иностранных обучающихся.'
),
'intern': (
'Практически все студенты, которые живут в ПУНКе, пользуются интернетом в общежитии.\n'
'Он выгоден и весьма удобен в использовании.\n\n'
'Для того, чтобы подключить интернет в вашем блоке, вам необходимо знать МАС-адрес вашего роутера. Он может быть указан на обратной стороне роутера.\n'
'<i> Помимо магазинов, хороший роутер можно купить на авито, юле или, например, у студента, который выложил объявление в группу <a href="https://vk.com/spbu_advert?from=search">Объявления СПбГУ : ПУНК, ВУНК, ДУНК</a></i>.\n\n'
'Как только вы нашли нужный МАС-адрес, необходимо выбрать один из трёх предложенных тарифов:\n'
'1️⃣Тариф 1. 30 Мбит/с  - 400 рублей в месяц (включая НДС)\n'
'2️⃣Тариф 2. 30 Мбит/с - 650 рублей в месяц (включая НДС)\n'
'3️⃣Тариф 4. 30 Мбит/с - 200 рублей в месяц (включая НДС)\n\n'
'❗Заявки на подключение к сети Интернет в общежитиях СПбГУ следует направлять по электронной почте с университетского адреса stxxxxxx@student.spbu.ru на адрес operator@spbu.ru.\n\n'
'Пример письма, которые вы должны отправить:\n'
'1. Ф.И.О.;\n'
'2. Число, месяц и год рождения;\n'
'3. Адрес общежития и номер комнаты;\n'
'4. Желаемый тариф;\n'
'5. MAC-адрес устройства (<a href="https://it.spbu.ru/files/howto/how-to-find-mac.pdf">как найти MAC-адрес</a>), которое Вы планируете использовать при подключении (MAC-адрес сетевой карты Вашего компьютера (ethernet адаптер) при подключении компьютера напрямую через кабель или WAN MAC-адрес Wi-Fi роутера, (если будет использоваться роутер, необходимо сообщить WAN MAC-адрес указанный в настройках роутера, а не тот, который указан на этикетке на обратной стороне роутера );\n'
'6. Ваш номер телефона для связи.\n\n'
'Вскоре вам на почту придёт ответное письмо, где будет указан ваш уникальный идентификационный номер (UID). Этот номер необходимо запомнить, так как для оплаты интернета и обращения за помощью к оператору необходимо указывать UID.\n\n'
'Оплатить интернет можно через <a href="https://pay.spbu.ru">сайт</a> в разделе "Услуги связи”.\n\n'
'❗Если вы указали МАС-адрес, но интернета нет, то возможно, вы указали LAN адрес, а не WAN. В таком случае необходимо отправить письмо на ранее указанную почту с описанием проблемы, <b>обязательно</b> указав свой UID.\n'
'Подробнее: https://it.spbu.ru/services/wi-fi/internet-v-obshchezhitiyakh.html'),

'terr': (
    'В самом кампусе помимо общежитий и администрации также есть:\n\n'
    '🏪 Круглосуточный минимаркет в общежитии №16, где вы всегда сможете купить базовый набор продуктов и хозтоваров или же обеспечить себя быстрым перекусом из широкого ассортимента готовой еды;\n\n'
    '🍔 Кафе "Герард Миллер"в общежитии №12, в котором вы сможете быстро и относительно недорого перекусить;\n\n'
    '💵 Банкоматы Сбера (общежитие №10) и ВТБ (общежитие №14);\n\n'
    '🚲 Прокат велосипедов в общежитии №20;\n\n'
    '🏓 Столы для настольного тенниса - в коворкинге общежития №12 и в холле пятого этажа общежития №22. Чтобы попасть ко второму, необходимо взять ключ на вахте;\n\n'
    '🎱 Бильярдный зал в общежитии №20. Необходимо заранее оплатить услугу на <a href="https://pay.spbu.ru">сайте единого платёжного сервиса</a>;\n\n'
    '👨‍🏫 Учебные комнаты (10, 12, 14, 20, 21, 22 общежития). Чтобы туда попасть, необходимо взять ключ на вахте;\n\n'
    '👥 Комфортабельные коворкинги в общежитиях 12, 13, 14;\n\n'
    '⚽ Для любителей спорта – несколько спортивных площадок: баскетбольная, волейбольная и футбольная, а также тренажёрный зал в общежитии №13. Попасть туда можно, купив абонемент на месте, причём помимо этого будет необходима справка о состоянии здоровья;\n\n'
    '🧺 Две прачечных — коммерческая, что находится между 21 и 22 общежитиями, и университетская, в общежитии №14. Первая имеет несколько больший ассортимент услуг, но и стоимость стирки соответственно выше. Оплата стирки в университетской прачечной осуществляется через <a href="https://pay.spbu.ru">сайт единого платёжного сервиса</a>. В коммерческой прачечной оплата осуществляется за наличный расчет через терминал.\n\n'
    '🎉 Общежитие №11, где часто собираются большие вечеринки для всех желающих;\n\n'
    '🔑 Ремонт ключей между общежитиями 22 и 23;\n\n'
    '🖨 Копировально-множительный центр (КМЦ) в 10 общежитии — место, где вы можете распечатать, отсканировать или отксерокопировать необходимый вам файл или изображение, предварительно оплатив услугу на <a href="https://pay.spbu.ru">сайте единого платёжного сервиса</a>;\n\n'
    '🏟️ ДКиН "Шайба"— место, где студенты могут активно проводить свободное от учёбы время. Здесь работают клубные формирования, например, различные виды танцев, хор, организовываются тематические вечера, игровые и развлекательные программы и другие культурно-досуговые мероприятия, также есть комната с музыкальными инструментами.'
),
'rooms': (
    'В ПУНКе общежития бывают двух типов: блочные (10, 12-16 общ.) и квартирные (20-23 общ.). Основное отличие — в квартирных общежитиях у вас будут свои кухня и санузел, в блочных — свой только санузел, кухня находится на этаже.\n\n'
    'Вне зависимости от типа помещения на каждого человека приходится:\n\n'
'1. Кровать;\n'
'2. Тумбочка;\n'
'3. Стол;\n'
'4. Навесная полка;\n'
'5. Шкаф;\n\n'
'Также при необходимости у коменданта можно получить набор личных вещей: подушку, одеяло, наволочку, пододеяльник, простынь, 2 маленьких полотенца (махровое и вафельное), верёвку, покрывало, шторы (одни на комнату) и настольную лампу.\n\n'
'❗Следует помнить, что при выселении по какой-либо причине, вам будет необходимо вернуть все вещи в полном комплекте!\n\n'
'C недавних пор блоки также делятся на "обычные"и так называемые места повышенной комфортности (МПК). Отличаются они в первую очередь наличием нового ремонта во вторых, и, конечно же, стоимостью проживания. С более подробной информацией о МПК вы можете ознакомиться на <a href="https://www.dormitoryspbu.ru">сайте</a>.'
),
'prik':(
    'Прикрепление к больнице является необязательным, но крайне желательным действием.\n'
    'Например, если в период сессии вы заболеете и не придете на экзамен, то без предъявления справки вам просто поставят неявку, и вы потратите одну из своих попыток впустую. \n\nТакже при трудоустройстве в лабораторию вам будет необходимо получить различные справки, которые без прикрепления получить сложнее. '
),
'18+': (
    'В первую очередь необходимо подготовить документы:\n'
    '1. Паспорт;\n'
    '2. СНИЛС;\n'
    '3. Полис ОМС/ДМС;\n\n'
    'Порядок действий для прикрепления:\n\n'
    '1. Поехать со всеми документами в Николаевскую больницу по адресу ул. Царицынская, 1 для регистрации в ней. После того как вы заполните все бумаги, вы будете зарегистрированы в базе Николевской больницы;\n'
    '2. Отправиться в отделение поликлиники по адресу ул. Ботаническая, 3/2. Там вам необходимо сказать, что необходимо прикрепиться.'
),
'18-': (
    'Для прикрепления в первую очередь необходимо посетить детскую поликлинику №67.\n'
    '☎️ Телефон: +7(812)246-51-26\n'
    '📍Адрес отделения, в которое вы будете ходить к врачу: ул. Шахматова, 12/1, лит. А.\n\n'
    'Порядок действий для прикрепления:\n\n'
    '1. Взять документы: паспорт, СНИЛС, полис ОМС/ДМС;\n\n'
    '2. Подойти в страховой стол по адресу: ул. Аврова, 19, лит. А, с 9:00 до 17:30 (обед с 13:00 до 13:30), чтобы вас занесли в базу;\n\n'
    '3. Уточнить по телефону часы работы педиатра на вашем участке;\n\n'
    '4. Прийти по адресу ул. Шахматова, д. 12/1 к участковому педиатру на приём в порядке очереди в часы работы, чтобы он занёс в базу этого отделения ваши данные.'
),
'gorod': (
    'Студенты, обучающиеся на бюджетной основе, имеющие регистрацию по месту жительства на территории Санкт-Петербурга, так же могут претендовать на место в общежитии.\n\n'
    'Однако для получения комнаты в общежитии дорога от места постоянной регистрации до учебных корпусов должна занимать <u>не менее двух часов</u> в одну сторону.\n\n'
    'Получают комнату в общежитии:\n'
    '1. С 15 сентября на срок до 30 июня в пределах одного учебного года;\n'
    '<u>В этот срок общежитие могут получить: студенты, прописанные в Курортном районе СПб, студенты, поступившие по БВИ и льготники.\nПеречень льгот можно найти в пункте 1.7.3 соответствующего <a href="https://students.spbu.ru/documents/obshchezhitie.html?task=weblink.go&id=98">Положения</a></u>.\n\n'
    '2. С 15 октября на срок до 30 июня в пределах одного учебного года.\n\n'
    'Места предоставляются студентам на основании личного заявления, поданного через Личный кабинет обучающегося (my.spbu.ru) в соответствии с <a href="https://students.spbu.ru/mmen-obwezhitiia/4007-podacha-zaYavlenii-na-poselenie-v-obshchezhitie-spbgu.html">инструкцией</a>, размещенной на портале Университета.\n\n'
    '❗ Заявление желательно подать как можно раньше (в первых числах сентября).'
    )
}